using System; // Базові математичні функції, генератор випадкових чисел і вивід у консоль

namespace Practice5
{
    public static class Block4
    {
        public static void Run()
        {
            Console.WriteLine(" БЛОК 4 ЧАС РОБОТИ ВІД UPS ВАРІАНТ 2 ");

            Random rnd = new Random(42); 
            int n = 100000; // Кількість симуляцій розряду батареї (100 000)
            double lambda = 0.25; // Інтенсивність розряду (середній час M = 1 / 0.25 = 4 години)

            double pGt6Theo = Math.Exp(-lambda * 6.0); // Теоретична ймовірність роботи понад 6 годин: e^(-1.5)
            double sum1 = 0.0; // Накопичувач суми часу для перевірки середнього
            int countGt6 = 0; // Лічильник випадків, коли батарея протрималася більше 6 годин

            for (int i = 0; i < n; i++) // Цикл прогону 100 000 аварійних відключень світла
            {
                double u = rnd.NextDouble(); // Рівномірне випадкове число від 0 до 1
                double x = -Math.Log(1.0 - u) / lambda; // Генеруємо час роботи UPS за показниковим законом
                sum1 += x; // Додаємо час у загальну суму

                if (x > 6.0) // Якщо час автономної роботи перевищив 6 годин — фіксуємо подію
                {
                    countGt6++; // Збільшуємо лічильник успішних випадків
                }
            }

            double meanStat = sum1 / n; // Вибірковий середній час роботи UPS
            double pGt6Stat = (double)countGt6 / n; // Статистична частота роботи понад 6 годин
            double error = Math.Abs(pGt6Stat - pGt6Theo); // Абсолютна похибка між симуляцією і теорією

            Console.WriteLine($"Середній час M[X]: стат={meanStat:F5} год, теор=4,00000 год"); // Виводимо статистичне та теоретичне значення середнього часу роботи UPS
            Console.WriteLine($"P(X > 6 год) теорія: {pGt6Theo:F5}"); // Виводимо теоретичну ймовірність роботи понад 6 годин
            Console.WriteLine($"W(X > 6 год) стат:   {pGt6Stat:F5}"); // Виводимо статистичну ймовірність роботи понад 6 годин
            Console.WriteLine($"Похибка:             {error:F5}");// Виводимо абсолютну похибку між статистичною та теоретичною ймовірністю
            Console.WriteLine();
        }
    }
}